it-tests/src/test/resources/war/toolkitx/testkit/examples/regsubmit/submitInheritNsDirect/body.txt

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<soapenv:Header>
		<wsa:MessageID>urn:uuid:FEE2030F0A7AC9E6301480434899886</wsa:MessageID>
		<wsa:Action soapenv:mustUnderstand="true">urn:ihe:iti:2007:RegisterDocumentSet-b</wsa:Action>
		<wsa:To>http://localhost:8080/xdstools41/sim/documentrepository__rep_test_support/reg/rb</wsa:To>
		<wsa:ReplyTo>
			<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
		</wsa:ReplyTo>
	</soapenv:Header>
	<soapenv:Body>
		<SubmitObjectsRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
			<RegistryObjectList xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
				<ExtrinsicObject id="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" mimeType="text/plain">
					<Slot name="creationTime">
						<ValueList>
							<Value>20051224</Value>
						</ValueList>
					</Slot>
					<Slot name="languageCode">
						<ValueList>
							<Value>en-us</Value>
						</ValueList>
					</Slot>
					<Slot name="serviceStartTime">
						<ValueList>
							<Value>200412230800</Value>
						</ValueList>
					</Slot>
					<Slot name="serviceStopTime">
						<ValueList>
							<Value>200412230801</Value>
						</ValueList>
					</Slot>
					<Slot name="sourcePatientId">
						<ValueList>
							<Value>89765a87b^^^&amp;1.3.4.5&amp;ISO</Value>
						</ValueList>
					</Slot>
					<Slot name="sourcePatientInfo">
						<ValueList>
							<Value>PID-3|pid1^^^&amp;1.2.3&amp;ISO</Value>
							<Value>PID-5|Doe^John^^^</Value>
							<Value>PID-7|19560527</Value>
							<Value>PID-8|M</Value>
							<Value>PID-11|100 Main St^^Metropolis^Il^44130^USA</Value>
						</ValueList>
					</Slot>
					<Slot name="hash">
						<ValueList>
							<Value>e543712c0e10501972de13a5bfcbe826c49feb75</Value>
						</ValueList>
					</Slot>
					<Slot name="size">
						<ValueList>
							<Value>36</Value>
						</ValueList>
					</Slot>
					<Slot name="repositoryUniqueId">
						<ValueList>
							<Value>1.2.16.840.1.113883.3.3700</Value>
						</ValueList>
					</Slot>
					<Name>
						<LocalizedString value="Physical"/>
					</Name>
					<Description/>
					<Classification id="id_1" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec" nodeRepresentation="">
						<Slot name="authorPerson">
							<ValueList>
								<Value>^Smitty^Gerald^^^</Value>
							</ValueList>
						</Slot>
						<Slot name="authorInstitution">
							<ValueList>
								<Value>Cleveland Clinic</Value>
								<Value>Parma Community</Value>
							</ValueList>
						</Slot>
						<Slot name="authorRole">
							<ValueList>
								<Value>Attending</Value>
							</ValueList>
						</Slot>
						<Slot name="authorSpecialty">
							<ValueList>
								<Value>Orthopedic</Value>
							</ValueList>
						</Slot>
					</Classification>
					<Classification id="id_2" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec" nodeRepresentation="">
						<Slot name="authorPerson">
							<ValueList>
								<Value>^Dopplemeyer^Sherry^^^</Value>
							</ValueList>
						</Slot>
						<Slot name="authorInstitution">
							<ValueList>
								<Value>Cleveland Clinic</Value>
								<Value>Berea Community</Value>
							</ValueList>
						</Slot>
						<Slot name="authorRole">
							<ValueList>
								<Value>Primary Surgon</Value>
							</ValueList>
						</Slot>
						<Slot name="authorSpecialty">
							<ValueList>
								<Value>Orthopedic</Value>
							</ValueList>
						</Slot>
					</Classification>
					<Classification id="id_3" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec" nodeRepresentation="DEMO-Ext Summary">
						<Slot name="codingScheme">
							<ValueList>
								<Value>1.3.6.1.4.1.21367.100.1</Value>
							</ValueList>
						</Slot>
						<Name>
							<LocalizedString value="Summary for External / Non Clinical Use"/>
						</Name>
					</Classification>
					<Classification id="id_4" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec" nodeRepresentation="V">
						<Slot name="codingScheme">
							<ValueList>
								<Value>2.16.840.1.113883.5.25</Value>
							</ValueList>
						</Slot>
						<Name>
							<LocalizedString value="very restricted"/>
						</Name>
					</Classification>
					<Classification id="id_5" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec" nodeRepresentation="urn:ihe:rad:TEXT">
						<Slot name="codingScheme">
							<ValueList>
								<Value>1.3.6.1.4.1.19376.1.2.3</Value>
							</ValueList>
						</Slot>
						<Name>
							<LocalizedString value="urn:ihe:rad:TEXT"/>
						</Name>
					</Classification>
					<Classification id="id_6" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec" nodeRepresentation="Outpatient">
						<Slot name="codingScheme">
							<ValueList>
								<Value>Connect-a-thon healthcareFacilityTypeCodes</Value>
							</ValueList>
						</Slot>
						<Name>
							<LocalizedString value="Outpatient"/>
						</Name>
					</Classification>
					<Classification id="id_7" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec" nodeRepresentation="General Medicine">
						<Slot name="codingScheme">
							<ValueList>
								<Value>Connect-a-thon practiceSettingCodes</Value>
							</ValueList>
						</Slot>
						<Name>
							<LocalizedString value="General Medicine"/>
						</Name>
					</Classification>
					<Classification id="id_8" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec" nodeRepresentation="XTHM-WD TYPECODE">
						<Slot name="codingScheme">
							<ValueList>
								<Value>1.3.6.1.4.1.21367.100.1</Value>
							</ValueList>
						</Slot>
						<Name>
							<LocalizedString value="XTHM-WD TYPECODE"/>
						</Name>
					</Classification>
					<ExternalIdentifier id="id_9" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" value="$patientid$">
						<Name>
							<LocalizedString value="XDSDocumentEntry.patientId"/>
						</Name>
					</ExternalIdentifier>
					<ExternalIdentifier id="id_10" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" value="1.42.20161129094708.60">
						<Name>
							<LocalizedString value="XDSDocumentEntry.uniqueId"/>
						</Name>
					</ExternalIdentifier>
				</ExtrinsicObject>
				<RegistryPackage id="SubmissionSet01" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
					<Slot name="submissionTime">
						<ValueList>
							<Value>20041225235050</Value>
						</ValueList>
					</Slot>
					<Name>
						<LocalizedString value="Physical"/>
					</Name>
					<Description>
						<LocalizedString value="Annual physical"/>
					</Description>
					<Classification id="id_11" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="SubmissionSet01" nodeRepresentation="">
						<Slot name="authorPerson">
							<ValueList>
								<Value>^Dopplemeyer^Sherry^^^</Value>
							</ValueList>
						</Slot>
						<Slot name="authorInstitution">
							<ValueList>
								<Value>Cleveland Clinic</Value>
								<Value>Berea Community</Value>
							</ValueList>
						</Slot>
						<Slot name="authorRole">
							<ValueList>
								<Value>Primary Surgon</Value>
							</ValueList>
						</Slot>
						<Slot name="authorSpecialty">
							<ValueList>
								<Value>Orthopedic</Value>
							</ValueList>
						</Slot>
					</Classification>
					<Classification id="id_12" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="SubmissionSet01" nodeRepresentation="34133-9">
						<Slot name="codingScheme">
							<ValueList>
								<Value>2.16.840.1.113883.6.1</Value>
							</ValueList>
						</Slot>
						<Name>
							<LocalizedString value="Summary of Episode Note"/>
						</Name>
					</Classification>
					<ExternalIdentifier id="id_13" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="SubmissionSet01" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" value="$ssid$">
						<Name>
							<LocalizedString value="XDSSubmissionSet.uniqueId"/>
						</Name>
					</ExternalIdentifier>
					<ExternalIdentifier id="id_14" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="SubmissionSet01" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" value="1.3.6.1.4.1.21367.4">
						<Name>
							<LocalizedString value="XDSSubmissionSet.sourceId"/>
						</Name>
					</ExternalIdentifier>
					<ExternalIdentifier id="id_15" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="SubmissionSet01" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" value="$patientid$">
						<Name>
							<LocalizedString value="XDSSubmissionSet.patientId"/>
						</Name>
					</ExternalIdentifier>
				</RegistryPackage>
				<Classification id="ID_170754953_1" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" classifiedObject="SubmissionSet01" classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd"/>
				<Association id="ID_170754953_2" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association" associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" sourceObject="SubmissionSet01" targetObject="urn:uuid:bdcf80c9-a34e-47dc-ae42-766f894077ec">
					<Slot name="SubmissionSetStatus">
						<ValueList>
							<Value>Original</Value>
						</ValueList>
					</Slot>
				</Association>
			</RegistryObjectList>
		</SubmitObjectsRequest>
	</soapenv:Body>
</soapenv:Envelope>