config/templates/xml/xdsodd.xml

{{define "xdsodd"}}
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header xmlns:addressing="http://www.w3.org/2005/08/addressing" xmlns:stctx="com.spirit.transaction.ctx">
    <addressing:To env:mustUnderstand="1">{{.EventServices.XDSRepService.Scheme}}://{{.EventServices.XDSRepService.Host}}:{{.EventServices.XDSRepService.Port}}/{{.EventServices.XDSRepService.Url}}</addressing:To>
    <addressing:Action env:mustUnderstand="1">urn:ihe:iti:2007:RegisterDocumentSet-b</addressing:Action>
    <addressing:MessageID>{{newuuid}}</addressing:MessageID>
    <addressing:ReplyTo>
      <addressing:Address>http://www.w3.org/2005/08/addressing/anonymous</addressing:Address>
    </addressing:ReplyTo>
    <stctx:context xmlns="http://docs.oasis-open.org/ws-caf/2005/10/wsctx">
      <context-identifier>{{newuuid}}</context-identifier>
    </stctx:context>
  </env:Header>
  <env:Body>
    <lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
      <rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
        <rim:ExtrinsicObject id="theDocument0" mimeType="{{.XDSOnDemandDocument.Mimetype}}" objectType="{{.XDSOnDemandDocument.Objecttype}}">
          <Slot name="repositoryUniqueId" xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
            <ValueList>
              <Value>{{.XDSOnDemandDocument.Repositoryuniqueid}}</Value>
            </ValueList>
          </Slot>
          <rim:Slot name="languageCode">
            <rim:ValueList>
              <rim:Value>{{.XDSOnDemandDocument.Languagecode}}</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Slot name="sourcePatientId">
            <rim:ValueList>
              <rim:Value>{{.REGId}}^^^&amp;{{.REGOid}}&amp;ISO</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Slot name="serviceStartTime">
            <rim:ValueList>
              <rim:Value>{{newdatetime}}</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Slot name="sourcePatientInfo">
            <rim:ValueList>
              <rim:Value>PID-3|{{.REGId}}^^^&amp;{{.REGOid}}&amp;ISO</rim:Value>
              <rim:Value>PID-5|Test5^Patient5</rim:Value>
              <rim:Value>PID-7|05052017</rim:Value>
              <rim:Value>PID-8|F</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Name>
            <rim:LocalizedString value="{{.XDSOnDemandDocument.Docname}}"/>
          </rim:Name>
          <rim:Description>
            <rim:LocalizedString value="{{.XDSOnDemandDocument.Docdesc}}"/>
          </rim:Description>
          <rim:Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="theDocument0" id="{{newid}}" nodeRepresentation="">
            <rim:Slot name="authorInstitution">
              <rim:ValueList>
                <rim:Value>{{.XDSOnDemandDocument.Authorinstitution}}</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Slot name="authorPerson">
              <rim:ValueList>
                <rim:Value>{{.XDSOnDemandDocument.Authorperson}}</rim:Value>
              </rim:ValueList>
            </rim:Slot>
          </rim:Classification>
          <rim:Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="theDocument0" id="{{newid}}" nodeRepresentation="{{.XDSOnDemandDocument.Classcode}}">
            <rim:Slot name="codingScheme">
              <rim:ValueList>
                <rim:Value>{{.XDSOnDemandDocument.Classcodescheme}}</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Name>
              <rim:LocalizedString value="{{.XDSOnDemandDocument.Classcodevalue}}"/>
            </rim:Name>
          </rim:Classification>
          <rim:Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="theDocument0" id="{{newid}}" nodeRepresentation="{{.XDSOnDemandDocument.Typecode}}">
            <rim:Slot name="codingScheme">
              <rim:ValueList>
                <rim:Value>{{.XDSOnDemandDocument.Typecodescheme}}</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Name>
              <rim:LocalizedString value="{{.XDSOnDemandDocument.Typecodevalue}}"/>
            </rim:Name>
          </rim:Classification>
          <rim:Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="theDocument0" id="{{newid}}" nodeRepresentation="{{.XDSOnDemandDocument.Practicesettingcode}}">
            <rim:Slot name="codingScheme">
              <rim:ValueList>
                <rim:Value>{{.XDSOnDemandDocument.Practicesettingscheme}}</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Name>
              <rim:LocalizedString value="{{.XDSOnDemandDocument.Practicesettingvalue}}"/>
            </rim:Name>
          </rim:Classification>
          <rim:Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="theDocument0" id="{{newid}}" nodeRepresentation="{{.XDSOnDemandDocument.Confcode}}">
            <rim:Slot name="codingScheme">
              <rim:ValueList>
                <rim:Value>{{.XDSOnDemandDocument.Confcodescheme}}</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Name>
              <rim:LocalizedString value="{{.XDSOnDemandDocument.Confcodevalue}}"/>
            </rim:Name>
          </rim:Classification>
          <rim:Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="theDocument0" id="{{newid}}" nodeRepresentation="{{.XDSOnDemandDocument.Facilitycode}}">
            <rim:Slot name="codingScheme">
              <rim:ValueList>
                <rim:Value>{{.XDSOnDemandDocument.Facilitycodescheme}}</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Name>
              <rim:LocalizedString value="{{.XDSOnDemandDocument.Facilitycodevalue}}"/>
            </rim:Name>
          </rim:Classification>
          <rim:Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="theDocument0" id="{{newid}}" nodeRepresentation="{{.XDSOnDemandDocument.Formatcode}}">
            <rim:Slot name="codingScheme">
              <rim:ValueList>
                <rim:Value>{{.XDSOnDemandDocument.Formatcodescheme}}</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Name>
              <rim:LocalizedString value="{{.XDSOnDemandDocument.Formatcodevalue}}"/>
            </rim:Name>
          </rim:Classification>
          <rim:ExternalIdentifier id="{{newid}}" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" registryObject="theDocument0" value="{{.REGId}}">
            <rim:Name>
              <rim:LocalizedString value="XDSDocumentEntry.patientId"/>
            </rim:Name>
          </rim:ExternalIdentifier>
          <rim:ExternalIdentifier id="{{newid}}" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" registryObject="theDocument0" value="{{.XDSOnDemandDocument.DocID}}">
            <rim:Name>
              <rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
            </rim:Name>
          </rim:ExternalIdentifier>
        </rim:ExtrinsicObject>
        <rim:RegistryPackage id="SubmissionSet" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
          <rim:Slot name="submissionTime">
            <rim:ValueList>
              <rim:Value>{{newdatetime}}</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Name>
            <rim:LocalizedString value="{{.XDSOnDemandDocument.Docname}}"/>
          </rim:Name>
          <rim:Description>
            <rim:LocalizedString value="{{.XDSOnDemandDocument.Docdesc}}"/>
          </rim:Description>
          <rim:Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="SubmissionSet" id="{{newid}}" nodeRepresentation="">
            <rim:Slot name="authorInstitution">
              <rim:ValueList>
                <rim:Value>{{.XDSOnDemandDocument.Authorinstitution}}</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Slot name="authorPerson">
              <rim:ValueList>
                <rim:Value>{{.XDSOnDemandDocument.Authorperson}}</rim:Value>
              </rim:ValueList>
            </rim:Slot>
          </rim:Classification>
          <rim:Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="SubmissionSet" id="{{newid}}" nodeRepresentation="{{.XDSOnDemandDocument.Typecode}}">
            <rim:Slot name="codingScheme">
              <rim:ValueList>
                <rim:Value>{{.XDSOnDemandDocument.Typecodescheme}}</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Name>
              <rim:LocalizedString value="{{.XDSOnDemandDocument.Typecodevalue}}"/>
            </rim:Name>
          </rim:Classification>
          <rim:ExternalIdentifier id="{{newid}}" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" registryObject="SubmissionSet" value="{{newuuid}}">
            <rim:Name>
              <rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
            </rim:Name>
          </rim:ExternalIdentifier>
          <rim:ExternalIdentifier id="{{newid}}" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" registryObject="SubmissionSet" value="{{.REGId}}">
            <rim:Name>
              <rim:LocalizedString value="XDSSubmissionSet.patientId"/>
            </rim:Name>
          </rim:ExternalIdentifier>
          <rim:ExternalIdentifier id="{{newid}}" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" registryObject="SubmissionSet" value="2.16.840.1.113883.2.1.3.31.2.15.1.1.1.9">
            <rim:Name>
              <rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
            </rim:Name>
          </rim:ExternalIdentifier>
        </rim:RegistryPackage>
        <rim:Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="SubmissionSet" id="{{newid}}"/>
        <rim:Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="as:{{newid}}" sourceObject="SubmissionSet" targetObject="theDocument0">
          <rim:Slot name="SubmissionSetStatus">
            <rim:ValueList>
              <rim:Value>Original</rim:Value>
            </rim:ValueList>
          </rim:Slot>
        </rim:Association>
      </rim:RegistryObjectList>
    </lcm:SubmitObjectsRequest>
  </env:Body>
</env:Envelope>
{{end}}